chat-server-v2/test/load-test-config.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Stress test"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
scenarios:
  - flow:
      - get:
          url: "/api/message"
      - get:
          url: "/api/conversation"